RARITY_ORDER = ["红", "金"]
RARITY_RANK = {r: i for i, r in enumerate(RARITY_ORDER)}

RARITY_COLOR = {
    "红": "#EF4444",
    "金": "#F59E0B",
}

ATTR_FULLNAME = {
    "敏": "敏捷",
    "力": "力量",
    "意": "意志",
    "智": "智识",
    "主": "主能力",
    "攻": "攻击提升",
    "生": "生命提升",
    "物": "物理伤害提升",
    "法": "法术伤害提升",
    "暴": "暴击率提升",
    "源": "源石技艺提升",
    "灼": "灼热伤害提升",
    "自": "自然伤害提升",
    "寒": "寒冷伤害提升",
    "电": "电磁伤害提升",
    "治": "治疗效率提升",
    "终": "终极技充能效率提升",
    "强": "强攻",
    "压": "压制",
    "巧": "巧技",
    "残": "残暴",
    "附": "附数",
    "迸": "迸发",
    "夜": "夜幕",
    "效": "效益",
    "粉": "粉碎",
    "追": "追袭",
    "流": "流转",
    "昂": "昂扬",
    "医": "医疗",
    "切": "切骨",
    # ...
}